/**
 * Russian locale
 */
const locale = {
  common: {
    path: 'Путь',
    reset: 'сбросить',
    newFolder: 'новая папка',
    select: 'Выбрать',
    connect: 'Подключение к UI серверу',
    disconnect: 'Нет соединения с UI сервером'
  },
  project: {
    headerTitle: 'React Проектный менеджер',
    projects: 'Проекты',
    create: 'Создать',
    import: 'Импорт',
    notFoundProjects: 'Не найдено проектов',
    folders: 'Папки',
    createNewProject: 'Создать новый проект',
    importProject: 'Избранное',
    favoriteProjects: 'Любимые проекты',
    otherProjects: 'Другие проекты'
  },
  projectCreate: {
    createProjectTitle: 'Создание нового проекта',
    nameProject: 'Название проекта',
    createProject: 'Создать проект',
    packageManager: 'Пакетный менеджер',
    selectPreset: 'Выбор базовых настроек',
    typeName: 'Введите имя',
    creatingProject: 'Создание проекта'
  },
  dashboard: {
    dashboard: 'Панель',
    dependencies: 'Зависимости',
    tasks: 'Задачи'
  },
  modal: {
    selectFolder: 'Выбор директории',
    createNew: 'Добавить новую папку',
    create: 'Добавить',
    title: 'Заголовок',
    newFolder: 'Новая папка',
    cancel: 'Отмена'
  },
  welcometips: {
    blot: 'Приветственные советы',
    welcome: 'Добро пожаловать в ваш новый проект!',
    tip1: 'Сейчас перед вами главная страница проекта, где вы можете разместить различные виджеты. Нажмите кнопку "Настроить" чтобы добавить виджеты! Все изменения автоматически сохраняются.',
    tip2: 'Слева находятся различные страницы."Плагины" позволяет добавлять новые плагины CLI , "Зависимости" для управления пакетами , "Конфигурация" чтобы настроить инструменты и "задачи" для выполнения скриптов(например webpack)',
    tip3: 'Вернитесь к менеджеру проектов с помощью выпадающего меню в левом верхнем углу экрана или кнопки "Домой" в строке состояния внизу.',
  }
}

export default locale
